"Vibration" = "Вибрация";
"Countdown Timer" = "Обратно броене";
"Auto-Start" = "Автостарт";
"Stopwatch" = "Секундомер";
"Default Timing Widget" = "Подразбирана контрола за време";
"General" = "Общи";
/* Customized */
"Default Duration (mins)" = "Подразбирана продължителност (мин)";
"Enabled" = "Включено";
"none given" = "не е зададено";
"Name" = "Име";
/* System default */
"Group" = "Група";
